#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
tls_private_key.trend-getter-key: Refreshing state... [id=a47ca5ce69932d82542644f179386827027c4e11]
data.aws_subnet.public_3: Reading...
data.aws_subnet.public_1: Reading...
data.aws_subnet.public_2: Reading...
data.aws_vpc.main: Reading...
aws_ecr_repository.trend-getter-lambda-ecr: Refreshing state... [id=trend-getter-lambda-ecr]
aws_key_pair.trend-getter-ec2-key: Refreshing state... [id=c18-trend-getter-kp]
aws_s3_bucket.c18-trend-getter-s3: Refreshing state... [id=c18-trend-getter-s3]
aws_ecr_repository.trend-getter-extract-and-load-ecr: Refreshing state... [id=trend-getter-extract-and-load-ecr]
data.aws_subnet.public_3: Read complete after 0s [id=subnet-0aed07ac008a10da9]
data.aws_subnet.public_2: Read complete after 0s [id=subnet-0f10662561eade8c3]
data.aws_subnet.public_1: Read complete after 0s [id=subnet-0679d4b1f9e7839ef]
aws_db_subnet_group.rds_subnet_group: Refreshing state... [id=c18-trend-getter-rds-subnet-group]
data.aws_vpc.main: Read complete after 1s [id=vpc-0adcb6a62ca552c01]
aws_security_group.rds_sg: Refreshing state... [id=sg-0699c97d0de8afddc]
aws_security_group.trend-getter-ec2-sg: Refreshing state... [id=sg-0ec95d6742c91e9bb]
aws_instance.ec2: Refreshing state... [id=i-034fe5b94adc3d579]
aws_db_instance.postgresql: Refreshing state... [id=db-UU2R632XBCS7PYO2UOF2LKE3AE]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_sns_topic.user_notifications will be created
  + resource "aws_sns_topic" "user_notifications" {
      + arn                         = (known after apply)
      + beginning_archive_time      = (known after apply)
      + content_based_deduplication = false
      + fifo_throughput_scope       = (known after apply)
      + fifo_topic                  = false
      + id                          = (known after apply)
      + name                        = "c18-trend-getter-sns"
      + name_prefix                 = (known after apply)
      + owner                       = (known after apply)
      + policy                      = (known after apply)
      + region                      = "eu-west-2"
      + signature_version           = (known after apply)
      + tags_all                    = (known after apply)
      + tracing_config              = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>
*Pushed by: @KirstineInvierno, Action: `pull_request`*